Revit 2027 API
BuiltInFailures.ViewSheetFailures.ViewInAModelMustBeUnique Property
 Sheet views in this model cannot contain more than one instance of "%1!s!."
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ViewInAModelMustBeUnique { get; }
Public Shared ReadOnly Property ViewInAModelMustBeUnique As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ViewInAModelMustBeUnique {
	FailureDefinitionId^ get ();
}
static member ViewInAModelMustBeUnique : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ViewSheetFailures Class
Autodesk.Revit.DB Namespace